sped/mdfe/homologacao/temporarias/201706/123123-consReciMDFe.xml

<?xml version="1.0" encoding="utf-8"?><soap12:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope"><soap12:Header><mdfeCabecMsg xmlns="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeRetRecepcao"><cUF>31</cUF><versaoDados>1.00</versaoDados></mdfeCabecMsg></soap12:Header><soap12:Body><mdfeDadosMsg xmlns="http://www.portalfiscal.inf.br/mdfe/wsdl/MDFeRetRecepcao"><consSitMDFe xmlns="http://www.portalfiscal.inf.br/mdfe" versao="1.00"><tpAmb>2</tpAmb><xServ>CONSULTAR</xServ><chMDFe>1231231321321231</chMDFe></consSitMDFe></mdfeDadosMsg></soap12:Body></soap12:Envelope>